app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Will this work?"], ["body", "I think so."], ["created_at", "2017-08-11 03:43:17.357815"], ["updated_at", "2017-08-11 03:43:17.357815"]]
---
  def create
=begin one way of doing articles
    @article = Article.new
    @article.title = params[:article][:title]
    @article.body = params[:article][:body]
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]
---
  def destroy
    @article = Article.find(params[:id])
    flash.notice = "Article '#{@article.title}' has been removed!"
    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "Image-3.jpg"], ["image_file_size", 63287], ["image_updated_at", "2017-09-05 09:44:32.098960"], ["updated_at", "2017-09-05 09:44:32.127494"], ["id", 14]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)